// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)


let clArr = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let x = 0;
//
// while (x < clArr.length) {
//     console.log(clArr[x]);
//     x++;
// }
//
// 2. перебрати його циклом for
// for (let i = 0; i < clArr.length; i++) {
//     console.log(clArr[i]);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// while (x < clArr.length) {
//     if (x % 2) {
//         console.log(clArr[x]);
//     }
//     x++;
// }
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < clArr.length; i++) {
//     if (i % 2) {
//         console.log(clArr[i])
//     }
// }


// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let z = 0;
//
// while (z < clArr.length) {
//     if (!(clArr[z] % 2)) {
//         console.log(clArr[z])
//     }
//     z++;
// }


// 6. перебрати циклом for та вивести  числа тільки парні  значення

// for (let i = 0; i < clArr.length; i++) {
//     if (!(clArr[i] % 2)) {
//         console.log(clArr[i]);
//     }
// }


// 7. замінити кожне число кратне 3 на слово "okten"

// for (let i = 0; i < clArr.length; i++) {
//     if (!(clArr[i] % 3)) {
//         clArr[i] = "okten";
//     }
// }
//
// console.log(clArr);
//
//
// for (let i = clArr.length - 1; i >= 0; i--) {
//     console.log(clArr[i]);
// }


// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)


let b = clArr.length - 1;

while (b >= 0) {
    console.log(clArr[b])
    b--;
}


// for (let i = clArr.length - 1; i >= 0; i--) {
//     console.log(clArr[i]);
// }
//
let k = clArr.length - 1;
//
// while (k >= 0) {
//     if ((k % 2)) {
//         console.log(clArr[k])
//     }
//     k--;
// }

// for (let i = clArr.length - 1; i >= 0; i--) {
//     if (i % 2) {
//         console.log(clArr[i]);
//     }
// }


// let g = clArr.length - 1;
// while (g >= 0) {
//     if (!(clArr[g] % 2)) {
//         console.log(clArr[g])
//     }
//     g--;
// }
//
//
// for (let i = clArr.length - 1; i >= 0; i--) {
//     if (!(clArr[i] % 2)) {
//         console.log(clArr[i]);
//     }
// }

for (let i = clArr.length - 1; i >= 0; i--) {
    if (!(clArr[i] % 3)) {
        clArr[i] = 'okten';
    }
}






